*> Antunes Jamba
*> Data 30/06/2026
IDENTIFICATION DIVISION.
PROGRAM-ID. DIA1-ESTRUTURA.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.

MAIN-PROCEDURE.
    PERFORM SAUDACAO
    PERFORM DESPEDIDA
    PERFORM EXTRA
    STOP RUN.

SAUDACAO.
    DISPLAY "Ola Antunes!".

DESPEDIDA.
    DISPLAY "Adeus, Antunes!".
 
 EXTRA.
    PERFORM SAUDACAO
    PERFORM DESPEDIDA.