IDENTIFICATION DIVISION.
PROGRAM-ID. Calculadora-SIMPLES.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM1     PIC 9(03).
01 WS-NUM2     PIC 9(03).
01 WS-RESULT   PIC 9(04).

PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "=== MINHA PRIMEIRA CALCULADORA COBOL ===".

    DISPLAY "DIGITE O PRIMEIRO NUMERO (ATE 3 DIGITOS): ".
    ACCEPT WS-NUM1.
    
    DISPLAY " DIGITE O SEGUNDO NUMERO (ATE 3 DIGITOS)".
    ACCEPT WS-NUM2.

    COMPUTE WS-RESULT = WS-NUM1 + WS-NUM2.

    DISPLAY " O RESULTADO DA SOMA É: " WS-RESULT.
    STOP RUN.