IDENTIFICATION DIVISION.
PROGRAM-ID. MEU-PROGRAMA.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.
MAIN-PROCEDURE.
    DISPLAY "Estrutura gerada com sucesso!".
    STOP RUN.